КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/КонтурЛогистика_ПунктыМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_ПунктыМаршрута</name>
  <attributes>
    <name>GLN</name>
    <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИндекс</name>
    <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКодРегион</name>
    <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфАдрес</name>
    <comment>(вариант 1) Текстовое представление адреса - обязательно при указании адреса простым текстом</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресИнфКодСтраны</name>
    <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресГород</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаселПункт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресУлица</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресРайон</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДом</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКорпус</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКварт</name>
    <comment>необязателен, используется при указании адреса через значения полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <comment>Нормализованное текстовое представление адреса по ГАР/ФИАС</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГАР</name>
    <comment>может быть указан вместо всех других адресных полей</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресГАРЗначение</name>
    <comment>JSON структуры адреса ФИАС/ГАР для исходящего XDTO</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКАдресу</name>
    <comment>необязательный, передается в сообщении для всех способов задания адреса</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыДолгота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыШирота</name>
    <comment>необязательно</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наш</name>
    <comment>если да, то становятся доступными расширенные настройки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправление</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Прибытие</name>
    <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Собственник</name>
    <comment>обязателен для пунктов отгрузки. ОрганизацияДиадок, являющаяся собственником пункта маршрута. Или укажите причину почему нет данных в реквизите СобственникНеУказанПричина</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственникНеУказанПричина</name>
    <comment>текстовое описание причины по которой для точки отгрузки нет сведений о её собственнике</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуДоговор</name>
    <comment>ОснДостОбИнфрДок - на основании чего пользуемся складом</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступКОбъектуТекст</name>
    <comment>ОснДостОбИнфрТекст  - Основание беспрепятственного доступа к объекту инфраструктуры пункта погрузки лица, осуществляющего погрузку груза в транспортное средство: текст при отсутствии подтверждающих документов</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасовойПояс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ПунктМаршрутаУчетнойСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>УИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияУИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТелефоныПереадресующегоПоУмолчанию</name>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателейУведомлений</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.КонтурЛогистика_ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтВодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНЗамечанияОтПеревозчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрНОтказГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_ПунктыМаршрута/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда 
		
		Наименование = ВычислитьАвтоНаименование();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АдресКодРегион) И Не ЗначениеЗаполнено(ЧасовойПояс) Тогда
		ЧасовойПояс = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЧасовойПоясПоКодуРегиона(АдресКодРегион);
	КонецЕсли;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ", ЭтотОбъект, Отказ);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("КонтурЛогистика_ПунктыМаршрута_ПередЗаписью_После", Истина, ПараметрыПМ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ОбъектУчетнойСистемыСсылка")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка) Тогда 
		
		ОбъектУчетнойСистемыСсылка = ДанныеЗаполнения.ОбъектУчетнойСистемыСсылка;
		
		Наименование = Строка(ОбъектУчетнойСистемыСсылка);
		НоваяСвязь = СвязанныеОбъекты.Добавить();
		НоваяСвязь.СвязанныйОбъект = ОбъектУчетнойСистемыСсылка;
		
		Если КонтурЛогистика_КонвертацияСервер.ЭтоНетиповаяСсылкаДляСвязанногоОбъекта(Ссылка, ОбъектУчетнойСистемыСсылка) Тогда
			КонтурЛогистика_КонвертацияСервер.ЗаполнитьДанныеДляНетиповогоСправочникаВСвязанныхОбъектах(НоваяСвязь, ОбъектУчетнойСистемыСсылка)
		КонецЕсли;
		
		// TODO включить после реализации справочника конвертации справочников
		// Справочники.КонтурЛогистика_НастройкиКонвертацииСправочников.ЗаполнитьСущность(ЭтотОбъект, ОбъектУчетнойСистемыСсылка, Перечисления.КонтурЛогистика_СправочникиКонтурЛогистика);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("Партнер")
		И ЗначениеЗаполнено(ДанныеЗаполнения.Партнер) Тогда 
		
		// заполняется из партнера EDI
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		КомментарийКАдресу = ДанныеЗаполнения.Партнер;
		КодПартнераКонтур = ДанныеЗаполнения.Партнер.КодПартнераКонтур;
		АдресИнфАдрес = ДанныеЗаполнения.Адрес;
		АдресИнфКодСтраны = Справочники.КонтурЛогистика_СтраныМира.НайтиПоКоду("643");
		Наименование = Наименование + "; " + ДанныеЗаполнения.Адрес + "; " + ДанныеЗаполнения.Партнер;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВычислитьАвтоНаименование() Экспорт
	
	НовоеНаименование = "";
	
	Если ЗначениеЗаполнено(АдресПредставление) Тогда
		Возврат АдресПредставление;
	КонецЕсли;
	
	НаименованиеПоПолям = СокрЛП("" +
		?(ЗначениеЗаполнено(АдресГород), АдресГород + ", ", "")  +
		?(ЗначениеЗаполнено(АдресНаселПункт), АдресНаселПункт + ", ", "") +
		?(ЗначениеЗаполнено(АдресУлица), АдресУлица + ", ", "") +
		АдресДом);
		
	Если ЗначениеЗаполнено(АдресГород) ИЛИ ЗначениеЗаполнено(АдресНаселПункт) Тогда 
		
		НовоеНаименование = НаименованиеПоПолям;
		
	ИначеЕсли ЗначениеЗаполнено(АдресИнфАдрес) Тогда
		
		НовоеНаименование = АдресИнфАдрес;
		
	ИначеЕсли ЗначениеЗаполнено(КодГАР) Тогда
		
		НовоеНаименование = КодГАР;
		
	ИначеЕсли ЗначениеЗаполнено(АдресКодРегион) ИЛИ ЗначениеЗаполнено(АдресИндекс)  Тогда
		
		НовоеНаименование = АдресИндекс + " регион: " + АдресКодРегион + " " + НаименованиеПоПолям;
		
	КонецЕсли;
	
	Возврат НовоеНаименование;
	
КонецФункции

#КонецЕсли
